# EXAMEN

In [89]:
# 1. Importació i càrrega de dades (1 punt)

# Importa pandas com a pd i carrega els tres fitxers CSV (clients.csv, products.csv, orders.csv).
# Mostra les 5 primeres files de cadascun dels tres dataframes.

In [90]:
import pandas as pd
clients_df = pd.read_csv('./data/clients.csv', header=0)
products_df = pd.read_csv('./data/products.csv', header=0)
orders_df = pd.read_csv('./data/orders.csv', header=0)

In [91]:
# 2. Neteja bàsica (1 punt)

# Mostra si existeixen valors nuls o duplicats en cadascun dels dataframes.

# Elimina'ls, si n'hi ha, fent servir les funcions adequades (dropna, drop_duplicates).

# Mostra el nombre de files abans i després del procés.

In [92]:
for df, name in zip([clients_df, products_df, orders_df], ['clients_df', 'products_df', 'orders_df']):
    print(f"DataFrame: {name}")
    print("Antes de la limpieza:")
    print(f"Valores nulos:\n{df.isna().sum()}")
    print(f"Filas duplicadas: {df.duplicated().sum()}")

    initial_rows = df.shape[0]
    df.dropna(inplace=True)
    df.drop_duplicates(inplace=True)
    final_rows = df.shape[0]

    print("Después de la limpieza:")
    print(f"Filas antes: {initial_rows}, Filas después: {final_rows}\n")

DataFrame: clients_df
Antes de la limpieza:
Valores nulos:
client_id    0
name         0
age          0
city         0
gender       0
dtype: int64
Filas duplicadas: 0
Después de la limpieza:
Filas antes: 100, Filas después: 100

DataFrame: products_df
Antes de la limpieza:
Valores nulos:
product_id      0
product_name    0
category        0
price           0
dtype: int64
Filas duplicadas: 0
Después de la limpieza:
Filas antes: 100, Filas después: 100

DataFrame: orders_df
Antes de la limpieza:
Valores nulos:
order_id      0
client_id     0
product_id    0
units         0
order_date    0
dtype: int64
Filas duplicadas: 0
Después de la limpieza:
Filas antes: 100, Filas después: 100

In [93]:
# 3. Fusió de datasets (1 punt)

# Uneix els tres datasets per obtenir un únic dataframe sales_df amb tota la informació.
# Empra les claus següents:

# client_id per unir clients_df amb orders_df

# product_id per unir amb products_df

# Mostra les primeres 5 files de sales_df.

In [94]:
sales_df = clients_df.join(orders_df.set_index('client_id'), on='client_id').join(products_df.set_index('product_id'), on='product_id') #join de las tres tablas
#eliminamos las filas con valores nulos en sales_df
sales_df.dropna(inplace=True)
sales_df.head()

,client_id,name,age,city,gender,order_id,product_id,units,order_date,product_name,category,price
3,4,Client_4,32,Barcelona,F,100.0,25.0,8.0,2023-10-08,Product_25,toys,164.86
4,5,Client_5,60,Barcelona,M,68.0,76.0,2.0,2022-04-19,Product_76,clothing,470.41
4,5,Client_5,60,Barcelona,M,88.0,33.0,6.0,2024-01-29,Product_33,home,349.51
6,7,Client_7,38,Tarragona,F,79.0,28.0,5.0,2022-11-11,Product_28,electronics,222.29
7,8,Client_8,56,Tarragona,M,93.0,13.0,7.0,2022-08-17,Product_13,books,263.51

In [95]:
# 4. Creació de columnes noves (1 punt)

# Afegeix una columna total_price que sigui el resultat de units * price.

# Converteix order_date a tipus datetime.

# Afegeix les columnes year i month extretes d’aquesta data.

In [96]:
sales_df['total_price'] = sales_df['units'] * sales_df['price'] # creamos la columna total_price
sales_df['order_date'] = pd.to_datetime(sales_df['order_date']) # cambiamos el tipo de order_date a datetime
sales_df['year'] = sales_df['order_date'].dt.year #creamos la columna year extrayendo el año de order_date
sales_df['month'] = sales_df['order_date'].dt.month #creamos la columna month extrayendo el mes de order_date
sales_df.head()

,client_id,name,age,city,gender,order_id,product_id,units,order_date,product_name,category,price,total_price,year,month
3,4,Client_4,32,Barcelona,F,100.0,25.0,8.0,2023-10-08,Product_25,toys,164.86,1318.88,2023,10
4,5,Client_5,60,Barcelona,M,68.0,76.0,2.0,2022-04-19,Product_76,clothing,470.41,940.82,2022,4
4,5,Client_5,60,Barcelona,M,88.0,33.0,6.0,2024-01-29,Product_33,home,349.51,2097.06,2024,1
6,7,Client_7,38,Tarragona,F,79.0,28.0,5.0,2022-11-11,Product_28,electronics,222.29,1111.45,2022,11
7,8,Client_8,56,Tarragona,M,93.0,13.0,7.0,2022-08-17,Product_13,books,263.51,1844.57,2022,8

In [97]:
# 5. Agrupacions i càlculs estadístics (1,5 punts)

# Calcula el total de vendes (total_price) per categoria.

# Calcula la mitjana d’edat dels clients per ciutat.

# Mostra la mitjana de preu i nombre total d’unitats venudes per categoria.

In [98]:
print("Total de ventas por categoría:")
sales_by_category = sales_df.groupby('category')['total_price'].sum() 
print(sales_by_category)
print("\nEdad media de los clientes por ciudad:")
avg_age_by_city = sales_df.groupby('city')['age'].mean()
print(avg_age_by_city)
print("\nMedia de precio y unidades vendidas por categoría:")
category_stats = sales_df.groupby('category').agg({'price': 'mean', 'units': 'sum'})
print(category_stats)

Total de ventas por categoría:
category
books          10377.66
clothing       21189.68
electronics    21002.85
home           19815.04
toys           31353.21
Name: total_price, dtype: float64

Edad media de los clientes por ciudad:
city
Barcelona    35.552632
Girona       55.000000
Lleida       44.692308
Palma        41.785714
Tarragona    41.958333
Name: age, dtype: float64

Media de precio y unidades vendidas por categoría:
                  price  units
category
books        204.650000   48.0
clothing     249.740526   78.0
electronics  173.546552  118.0
home         231.856471   76.0
toys         237.602000  127.0

In [99]:
# 6. Filtratge i ordenació (1 punt)

# Mostra les vendes del 2023 per a la categoria electronics.

# Ordena el resultat pel total_price descendent.

In [100]:
sales_df_2023_electronics = sales_df[(sales_df['year'] == 2023) & (sales_df['category'] == 'electronics')] # filtramos las ventas del 2023 para la categoria electronics
sales_df_2023_electronics.sort_values(by='total_price', ascending=False, inplace=True) # ordenamos por total_price descendente
sales_df_2023_electronics.head() #mostramos las primeras 5 filas del resultado

C:\Users\alanr\AppData\Local\Temp\ipykernel_8148\588542812.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_df_2023_electronics.sort_values(by='total_price', ascending=False, inplace=True) # ordenamos por total_price descendente

,client_id,name,age,city,gender,order_id,product_id,units,order_date,product_name,category,price,total_price,year,month
73,74,Client_74,46,Lleida,F,76.0,58.0,7.0,2023-03-01,Product_58,electronics,248.35,1738.45,2023,3
20,21,Client_21,61,Girona,M,4.0,19.0,5.0,2023-11-03,Product_19,electronics,268.02,1340.10,2023,11
58,59,Client_59,24,Palma,M,34.0,58.0,3.0,2023-12-20,Product_58,electronics,248.35,745.05,2023,12
12,13,Client_13,41,Tarragona,M,33.0,6.0,5.0,2023-09-17,Product_6,electronics,146.84,734.20,2023,9
8,9,Client_9,36,Barcelona,M,84.0,27.0,4.0,2023-05-31,Product_27,electronics,139.06,556.24,2023,5

In [101]:
# 7. Anàlisi de benefici (1,5 punts)

# Afegeix una columna cost_unitari, que sigui un valor aleatori entre el 60% i el 90% del preu (price).

# Calcula una nova columna benefici = (price - cost_unitari) * units.

# Agrupa per categoria i mostra:

#  total de vendes

#  benefici total

#  marge mitjà en percentatge → (benefici / total_price) * 100

In [109]:
import numpy as np
sales_df['cost_unitari'] = sales_df['price'] * np.random.uniform(0.6, 0.9, size=sales_df.shape[0]) # creamos la columna cost_unitari con valores aleatorios entre el 60% y 90% del precio
sales_df['benefici'] = (sales_df['price'] - sales_df['cost_unitari']) * sales_df['units'] # creamos la columna benefici
print("Primeras 5 filas de sales_df con las nuevas columnas:")
print(sales_df[['price', 'cost_unitari','units', 'benefici']].head())
category_analysis = sales_df.groupby('category').agg( #agrupamos por categoria y calculamos las métricas solicitadas
    total_vendes=('total_price', 'sum'),
    benefici_total=('benefici', 'sum')
)

category_analysis['marge_mitja_percentatge'] = ((category_analysis['benefici_total'] / category_analysis['total_vendes']) * 100 ) 
print("Análisis de ventas por categoría:")
category_analysis

Primeras 5 filas de sales_df con las nuevas columnas:
    price  cost_unitari  units    benefici
3  164.86    145.281145    8.0  156.630842
4  470.41    349.025871    2.0  242.768259
4  349.51    302.796323    6.0  280.282062
6  222.29    147.200410    5.0  375.447951
7  263.51    200.454942    7.0  441.385406
Análisis de ventas por categoría:

             total_vendes  benefici_total  marge_mitja_percentatge
category
books            10377.66     2582.969333                24.889709
clothing         21189.68     4813.921621                22.718237
electronics      21002.85     5670.073672                26.996687
home             19815.04     4351.005497                21.958096
toys             31353.21     9100.075766                29.024383

In [103]:
# 8. Normalització per grups (1 punt)

# Normalitza la columna benefici dins de cada categoria, dividint-la pel màxim benefici d’aquell grup.

# Afegeix el resultat en una nova columna benefici_normalitzat.

In [110]:
group_max = sales_df.groupby('category')['benefici'].transform('max')
sales_df['benefici_normalitzat'] = np.where(group_max > 0, sales_df['benefici'] / group_max, 0)
print("Columna 'benefici_normalitzat' creada. Primeras filas:")
sales_df.head()

Columna 'benefici_normalitzat' creada. Primeras filas:

,client_id,name,age,city,gender,order_id,product_id,units,order_date,product_name,category,price,total_price,year,month,cost_unitari,benefici,benefici_normalitzat
3,4,Client_4,32,Barcelona,F,100.0,25.0,8.0,2023-10-08,Product_25,toys,164.86,1318.88,2023,10,145.281145,156.630842,0.131749
4,5,Client_5,60,Barcelona,M,68.0,76.0,2.0,2022-04-19,Product_76,clothing,470.41,940.82,2022,4,349.025871,242.768259,0.267213
4,5,Client_5,60,Barcelona,M,88.0,33.0,6.0,2024-01-29,Product_33,home,349.51,2097.06,2024,1,302.796323,280.282062,0.188180
6,7,Client_7,38,Tarragona,F,79.0,28.0,5.0,2022-11-11,Product_28,electronics,222.29,1111.45,2022,11,147.200410,375.447951,0.343025
7,8,Client_8,56,Tarragona,M,93.0,13.0,7.0,2022-08-17,Product_13,books,263.51,1844.57,2022,8,200.454942,441.385406,0.338647

In [105]:
# 9. Filtratge avançat i exportació (1 punt)

# Mostra només les categories on la mitjana del benefici normalitzat sigui superior a 0.5.

# Desa aquest subconjunt en un fitxer CSV anomenat filtered_sales.csv.

In [114]:
category_df = sales_df.groupby('category')['benefici_normalitzat'].mean().reset_index()
filtered_categories = category_df[category_df['benefici_normalitzat'] > 0.5]['category']
filtered_sales_df = sales_df[sales_df['category'].isin(filtered_categories)]
filtered_sales_df.to_csv('filtered_sales.csv', index=False)
print("DataFrame filtrado guardado en 'filtered_sales.csv'. Primeras filas:")
print(filtered_sales_df.head())

print("El csv esta vacio ya que ningun categoria tiene una media de benefici normalitzat superior a 0.5")

DataFrame filtrado guardado en 'filtered_sales.csv'. Primeras filas:
Empty DataFrame
Columns: [client_id, name, age, city, gender, order_id, product_id, units, order_date, product_name, category, price, total_price, year, month, cost_unitari, benefici, benefici_normalitzat]
Index: []
El csv esta vacio ya que ningun categoria tiene una media de benefici normalitzat superior a 0.5